// 3 Task.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#define _CRT_SECURE_NO_WARNINGS
#include <iostream>
int main()
{
    int a,b,c,N;
    printf("Enter the numbers: ");
    scanf("%d,%d,%d,%d", &a, &b, &c, &N);
    if (a % N != 0 && b % N != 0 && c % N != 0)
        printf("No number is divide by N");
    else
    {
        printf("Numbers that divide by N are: ");
        if (a % N == 0)
            printf("%d  ", a);
        if (b % N == 0)
            printf("%d  ", b);
        if (c % N == 0)
            printf("%d  ", c);
    }
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
